#4/4 read
# 資料：程式的基本單位
# 數字
3456
2.398
# 字串
"用雙引號匡起來","Hello World"
# 布林值 (記得要大寫)
True,False
# 有順序、可動的列表 List，使用中括號[]
[3,4,5],["Hello","World"]
# 有順序、不可動的列表 Tuple，使用小括號()
(3,4,5),("Hello","World")
# 集合 Set，沒有順序的概念，使用大括號{}
{3,4,5},{"Hello","World"}
# 字典 Dicrionary ，鍵(key)跟值(value)的配對，使用大括號{}，括號內要用雙引號，鍵與值相互對應要用":"，輸入多個則用逗號","區隔不同的值
{"apple":"蘋果","data":"資料"}
# 變數 用來儲存資料的自訂名稱，"變數名稱＝資料"
x=3 #左邊就為，把3放到x裡
print(x) #可以用變數名稱，直接把它印出來，但前提是需要寫變數，如沒有寫則印不出來
# print(資料)
print(True) #在終端機就會印出()內的東西
x=[3,4,5]
print("x",x)
